<?php

namespace Database\Seeders;

use App\Models\News;
use Illuminate\Database\Seeder;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $news = [
            [
                'category_id' => 7,
                'title' => 'युक्रेनमा भएको आक्रमणको नेपालले गर्‍यो विरोध',
                'slug' => 'युक्रेनमा-भएको-आक्रमणको-नेपालले-गर्‍यो-विरोध',
                'province_id' => 1,
                'description' => '१२ फागुन, काठमाडौं । रुसले युक्रेनमा विशेष सैन्य कारबाही सुरु गरेपछि नेपालले मुख खोलेको छ । बिहीबार परराष्ट्र मन्त्रालयले एक विज्ञप्ति जारी गर्दै कुनै पनि सार्वभौम मुलुकविरुद्ध हुने बल प्रयोगको कडा विरोध गर्ने बताएको छ ।
                त्यस्तै, मन्त्रालयले जारी गरेको विज्ञप्तिमा सम्बन्धित सबै पक्षलाई अधिकतम संयमता अपनाएर तनाव चर्किन नदिन समेत भनेको छ । ‘नेपाल सरकारले युक्रेनमा विकसित घटनाक्रमलाई नजिकबाट पछ्याइरहेको छ’, मन्त्रालयको विज्ञप्तिमा भनिएको छ, ‘नेपालले सम्बन्धित सबै पक्षलाई अधिकतम संयमता अपनाएर तनाव कम गर्न अपिल गर्न चाहन्छ ।’
                कुनै पनि मुलुकको सार्वभौमिकता र भौगोलिक अखण्डता अक्षुण रहेको भन्दै यसको पूर्ण सम्मान हुनुपर्ने पनि नेपालको भनाइ छ । ‘संयुक्त राष्ट्रसंघको सदस्य भएको हुँदा राष्ट्रसंघको बडापत्रमा उल्लिखित सार्वभौमिकता र भौगोलिक अखण्डताको सिद्धान्त अक्षुण रहेको र यसको पूर्ण पालना हुनुपर्छ’, विज्ञप्तिमा भनिएको छ ।',
                'is_trending' => 1,
                'is_main_news' => 1,
                'status' => '1'
            ],
            [
                'category_id' => 7,
                'title' => 'युक्रेनमा मार्शल ल, रुसका ५ विमान खसालेको दाबी',
                'slug' => 'युक्रेनमा-मार्शल-ल,-रुसका-५-विमान-खसालेको=दाबी',
                'province_id' => 1,
                'description' => 'युक्रेनले पाँच वटा रुसी विमान र हेलिकप्टर खसालेको दाबी गरेको छ । युक्रेनका राष्ट्रपति भोलोडिमिर जेलेन्स्कीले बिहीबार युक्रेनविरुद्ध रुसले सैन्य कारबाही शुरु गरेपछि देशमा मार्शल लको घोषणा गरेका छन् ।
                १२ फागुन, काठमाडौं । युक्रेनले पाँच वटा रुसी विमान र हेलिकप्टर खसालेको दाबी गरेको छ ।
                विद्रोही नियन्त्रित एन्क्लेभ नजिक पाँच वटा रुसी विमान र एउटा हेलिकप्टर खसालेको दाबी युक्रेनी सेनाले गरेको हो ।',
                'is_trending' => 1,
                'is_main_news' => 1,
                'status' => '1'
            ],
            [
                'category_id' => 7,
                'title' => 'रुसका पाँचवटा लडाकु विमान खसालेको युक्रेनको दाबी',
                'slug' => 'यरुसका-पाँचवटा-लडाकु-विमान-खसालेको-युक्रेनको-दाबी',
                'province_id' => 1,
                'description' => '१२ फागुन, काठमाडौं । रुसी राष्ट्रपति भ्लादिमिर पुटिनको आदेशलगत्तै युक्रेनका कैयौं सहरमा बम, क्षेप्यास्त्र र गोलाबारी सुरु भएको छ ।
                युक्रेनको राजधानी किएभसहित प्रमुख सहरमा रकेट आक्रमण भएको छ । रुसी फौजले ओडेसास्थित युक्रेनी जल सेनाका टुकडीमाथि बम खसालेको छ । खार्किभ र मारिउपोललगायत सहरमा ठूलो संख्यामा रुसी सेना प्रवेश गरिसकेका छन् । रुसी सेनाले युक्रेनी वायु सेनाका पूर्वाधार ध्वस्त पारेको बताइसकेको छ ।',
                'is_trending' => 1,
                'is_main_news' => 1,
                'status' => '1'
            ],

            [
                'category_id' => 9,
                'title' => 'लगानी रोक्ने नीतिपछि के होला घरजग्गा कारोबार',
                'slug' => 'लगानी-रोक्ने-नीतिपछि-के-होला-घरजग्गा-कारोबार',
                'province_id' => 2,
                'description' => '११ फागुन, काठमाडौं । बैंक तथा वित्तीय क्षेत्रमा तरलताको असर बढ्दै जाँदा राष्ट्र बैंकको नजर घरजग्गातिर सोझिएको छ । घरजग्गा क्षेत्रको लगानीले अन्य क्षेत्रको तुलनामा अर्थतन्त्रमा कम प्रतिफल दिने राष्ट्र बैंकको निष्कर्ष छ ।
                घरजग्गा कर्जामा कडाइ गरे उत्पादनशील क्षेत्रमा जाने कर्जामा वृद्धि भएर अर्थतन्त्र वलियो बन्न मद्दत पुग्ने तर्क गर्दै चालु आर्थिक वर्ष २०७८/७९ का लागि राष्ट्र बैंकले ल्याएको मौद्रिक नीतिको अर्धवार्षिक समीक्षा गर्दै घरजग्गामा जाने कर्जामा कडाइ गर्ने बताएको छ ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],
            [
                'category_id' => 9,
                'title' => 'बैंकहरुले कर्जाको निवेदन नै लिन छाडे',
                'slug' => 'बैंकहरुले-कर्जाको-निवेदन-नै-लिन-छाडे',
                'province_id' => 2,
                'description' => '१० फागुन, काठमाडौं । बागबजारका रमेशकुमार (नाम परिवर्तन) ३० लाख रुपैयाँको ऋण माग गर्दै गत आइतबार नेपाल बैंक लिमिटेड पुगे । नेपाल बैंकमा नियमित रुपमा कारोबार गर्ने गरेका उनले यसअघि मागे अनुसारको ऋण सहजै पाउने गरेका थिए । ऋण लिएपछि समयमा नै भुक्तानी गरेका उनी नेपाल बैंकको असल ऋणीमै आफू पर्ने सुनाउँछन् ।

            ‘थोरै रकम चाहिएको थियो, पर्सनल ओभरड्राफ्ट लोन माग गर्नका लागि म बैंकमा पुगेको थिएँ,’ उनले अनलाइनखबरसँग भने, ‘लोन शाखाको सरले अहिले ऋण मागको निवेदन नै लिन नसकिने अवस्थामा रहेको सुनाउनु भयो, अलि सहज भएपछि पहिलो प्राथमिकतामा राख्छु भन्नु भएपछि म रित्तै फर्किएँ ।’ उनको जग्गा समेत बैंकमा रोक्का अवस्थामा नै छ । अप्ठेरो पर्दा ऋण लिने र समयमा चुक्ता गर्ने गरेका उनले जग्गा फुकुवा समेत गरिसकेका छैनन् ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],
            [
                'category_id' => 9,
                'title' => 'सेयर बजारमा ५९ अंकको गिरावट, परिसूचक २७ सय तल झर्‍यो',
                'slug' => 'सेयर-बजारमा-५९-अंकको-गिरावट,-परिसूचक-२७-सय-तल-झर्‍यो',
                'province_id' => 2,
                'description' => '१२ फागुन, काठमाडौं । बुधबार दोहोरो अंकले घटेको सेयर बजार साताको अन्तिम दिन बिहीबार पनि घटेको छ । नेप्से परिसूचक ५८ दशमलव ९९ अंकले घटेर २ हजार ६ सय ६१ दशमलव ४४ अंकमा झरेको छ ।

                ‘क’ वर्गका कम्पनीहरुको कारोबार मापन गर्ने सेन्सेटिभ इन्डेक्स पनि १० दशमलव ३६ अंकले घटेको छ । नेप्से परिसूचक घटेपनि सेयर कारोबार रकममा भने बुधबारको भन्दा सुधार भएको छ । बुधबार ३ अर्बको कारोबार भएकोमा बिहीबार कारोबार रकम ४ अर्ब नाघ्यो ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 12,
                'title' => 'च्यासललाई हराउँदै सातदोबाटो तेस्रो स्थानमा',
                'slug' => 'च्यासललाई-हराउँदै-सातदोबाटो-तेस्रो-स्थानमा',
                'province_id' => 3,
                'description' => '१२ फागुन, काठमाडौं । पहिलो पटक शीर्ष डिभिजनमा खेलिरहेको सातदोबाट युथ क्लबले शहीद स्मारक ‘ए’ डिभिजन लिगको आफ्नो अन्तिम खेलमा रेलिगेसनमा परिसकेको च्यासल युथ क्लबलाई १-०ले पराजित गरेको छ ।

                यो नतिजासँगै नवप्रवेशी सातदोबाटोले ए डिभिजनमा सुखद अन्त्य गरेको छ । एन्फा कम्प्लेक्समा बिहीबार भएको खेलमा सातदोबाटोलाई जित दिलाउन विदेशी खेलाडी अजयी मार्टिन्सले एक मात्र गोल गरे । उनले खेलको सातौं मिनेटमा सुदिप गुरुङको लामो पासमा गरेको गोल नै जितमा निर्णायक बन्यो ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],
            [
                'category_id' => 12,
                'title' => 'ए डिभिजन लिगमा आज दुई खेल',
                'slug' => 'ए-डिभिजन-लिगमा-आज-दुई-खेल',
                'province_id' => 3,
                'description' => 'यस्तै अपरान्ह ४:४५ बजे दशरथ रंगशालामै हुने अर्को खेलमा त्रिभुवन आर्मी क्लब र संङ्कटा क्लबबीच प्रतिस्पर्धा हुनेछ । यस सिजन अपराजित रहेको आर्मी ११ खेलबाट १९ अंकसहित चौथो स्थानमा छ । आर्मीले जित हात पारे दोस्रो स्थानमा उक्लनेछ ।
                उता सिजनको सुरुवात उत्कृष्ट गरेको संकटा पछिल्लो खेलहरुमा लय कायम राख्न नसक्दा ११ खेलबाट १५ अंकसहित सातौं स्थानमा छ । आज आर्मीलाई हराउन सके संकटाले शीर्ष पाँचमा स्थान बनाउनेछ ।

                यस सिजनको उपाधि जित्ने टोली र रेलिगेसन पर्ने दुई टोलीको टुङ्गो लागिसकेकाले अब बाँकी खेल शीर्ष तीनमा पर्न र सकेसम्म माथिल्लो स्थानमा लिग सकाउनका लागि हुनेछ ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],
            [
                'category_id' => 12,
                'title' => 'थ्रीस्टार र पुलिसले अंक बाँडे',
                'slug' => 'थ्रीस्टार-र-पुलिसले-अंक-बाँडे',
                'province_id' => 3,
                'description' => '४ फागुन, काठमाडौं । शहीद स्मारक ए डिभिजन लिगमा थ्रीस्टार क्लब र नेपाल पुलिस क्लबले १-१ को बराबरी खेल्दै अंक बाडेका छन् ।
            त्रिपुरेश्वरस्थित दशरथ रंगशालमा भएको खेलमा थ्रीस्टारले पहिलो हाफमा अग्रता लिए पनि जोगाउन सकेन र दोस्रो हाफमा पुलिसले गोल फर्कायो ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 1,
                'title' => 'प्रधान सेनापति शर्मा र भारतीय सेनाका लेफ्टिनेन्ट जनरलबीच भेटवार्ता',
                'slug' => 'प्रधान-सेनापति-शर्मा-र-भारतीय-सेनाका-लेफ्टिनेन्ट-जनरलबीच-भेटवार्ता',
                'province_id' => 3,
                'description' => '१२ फागुन, काठमाडौं । प्रधान सेनापति प्रभुराम शर्मा र भारतीय सेनाका लेफ्टिनेन्ट जनरल पीएन अनन्थनारायणनबीच भेटवार्ता भएको छ ।नेपाल भ्रमणमा रहेका लेफ्टिनेन्ट जनरल अनन्थनारायणनबीच जंगी अड्डामा भेटवार्ता भएको हो ।

                नेपाली सेनाको जनसम्पर्क तथा सूचना निर्देशनालयका अनुसार महारथी शर्माको कार्यालयमा भएको भेटमा दुई पक्षीय हित तथा पारस्परिक सम्बन्धका विषयमा छलफल भएको थियो । नेपाली सेनाले यस किसिमको भेटघाटले दुई देशका सेनाबीच रहँदै आएको आपसी सम्बन्ध सुमधुर एवं प्रगाढ हुने बताएको छ ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 2,
                'title' => 'वातावरणीय मुद्दा सम्बोधनमै सबैको हित छ',
                'slug' => 'वातावरणीय-मुद्दा-सम्बोधनमै-सबैको-हित-छ',
                'province_id' => 4,
                'description' => 'हामी नगरपालिकामा निर्वाचित भएर आएपछि विकास बारेको बुझाइ बदल्ने गरी काम गर्न खोज्यौं । पहिला जो अलि ठूलाबडा थिए, उनीहरूले जहाँ जसरी बजेट हाल्थे, त्यही मात्रै काम हुन्थ्यो ।

                अहिले हामीले सबैभन्दा पहिला जनसमुदायको माग के हो, त्यसको आवश्यकता कति हो र त्यसले दिने प्रतिफल के हुन्छ भन्ने आधारमा काम गरिरहेका छौं । त्यो काम गर्दा हुने फाइदा के-के हुन् र सम्भावित नराम्रा प्रभाव के हुनसक्छन् भनेर पनि हामी हेर्छाैं ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 3,
                'title' => 'सुनको मूल्य यो वर्षकै उच्च बिन्दुमा',
                'slug' => 'सुनको-मूल्य-यो-वर्षकै-उच्च-बिन्दुमा',
                'province_id' => 4,
                'description' => '३० कात्तिक, काठमाडौं । नेपाली बजारमा सुनको मूल्य यो वर्षकै उच्च बिन्दुमा पुगेको छ । नेपाल सुन चाँदी व्यवसायी महासंघले मंगलबारका लागि छापावाल सुनको मूल्य तोलामा ९४ हजार ८ सय रुपैयाँ तोकेको छ ।

                यो मूल्य गत वर्ष पुसयताकै सबैभन्दा उच्च हो । सोमबारको कारोबार मूल्यभन्दा प्रतितोला सुनको मूल्य ५ सय रुपैयाँले महँगो भएको महासंघले जनाएको छ । गत पुस २४ गते प्रतितोला सुनको मूल्य ९५ हजार ३ सय रुपैयाँ थियो ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 4,
                'title' => 'अध्यागमनले फर्काइदियो दुबई उड्न लागेका ७६ यात्रु',
                'slug' => 'अध्यागमनले-फर्काइदियो-दुबई-उड्न-लागेका-७६-यात्रु',
                'province_id' => 4,
                'description' => '२१ मंसिर, काठमाडौं । दुबई घुम्न जान लागेका ७६ जना यात्रुलाई त्रिभुवन अन्तर्राष्ट्रिय विभानस्थलस्थित अध्यागम कार्यालयले फर्काइदिएको छ ।

                ललितपुरको जावलाखेलस्थित शुभेक्षा बहुउद्देश्यी सहकारी संस्थाबाट दुबई घुम्न जान लागेको बताएका उनीहरूलाई मानव ओसारपसारको आशंकामा फर्काइएको प्रमुख अध्यागम अधिकृत पुष्पराज शाहीले जानकारी दिए । ‘सहकारीको पत्र ल्याएर ७६ जना मान्छे आएका थिए । ७० प्रतिशत महिला थिए’ उनले भने, ‘मानव ओसारपसार जस्तै महिला ओसारपसार गर्न खोजेको हुनसक्छ । त्यसैले फर्कायौं ।’',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 5,
                'title' => 'भागवत गीताको श्लोक भन्दै आलियाले दिइन् कंगनालाई जवाफ',
                'slug' => 'भागवत-गीताको-श्लोक-भन्दै-आलियाले-दिइन्-कंगनालाई-जवाफ',
                'province_id' => 4,
                'description' => '११ फागुन, काठमाडौं । अभिनेत्री आलिया भट्ट अभिनित चलचित्र ‘गंगुबाई काठियावाडी’ शुक्रबारदेखि प्रदर्शन हुँदैछ । यो चलचित्रका लागि निर्देशक सञ्जय लीला भन्सालीले २०० करोड भारु लगानी गरेका छन् ।

                चलचित्रको विषयवस्तुलाई लिएर विरोध पनि भइरहेको छ । विरोधकाबीच अभिनेत्री कंगना रनावतले आलियाको अभिनय र स्टारडममाथि नै प्रश्न उठाएकी थिइन् । कंगनाले शुक्रबार २०० करोड जलेर खरानी हुने उल्लेख गरेकी थिइन् । उनले चलचित्रमा आलियालाई लिनु नै सबैभन्दा ठूलो भूल भएको आरोप समेत लगाएकी थिइन् ।’',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 6,
                'title' => 'पल शाहविरुद्ध किटानी जाहेरी',
                'slug' => 'पल-शाहविरुद्ध-किटानी-जाहेरी',
                'province_id' => 4,
                'description' => '११ फागुन, काठमाडौं । अभिनेता पल शाहविरुद्ध जबरजस्ती करणीसम्बन्धी कसूरमा किटानी जाहेरी परेको छ ।

                एक गायिकाले शाहविरुद्ध जिल्ला प्रहरी कार्यालय, तनहुँमा किटानी जाहेरी दिएको प्रहरी स्रोतले जानकारी दिएको छ । यसअघि जिल्ला प्रहरी कार्यालय, कास्कीमा शाहविरुद्ध जाहेरी दिइएको थियो । तर, प्रहरीले घटनास्थल तनहुँ भएकाले तनहुँमै दर्ता गर्न सुझाव दिएको थियो ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],
            [
                'category_id' => 8,
                'title' => 'घरभन्दा अपार्टमेन्ट खर्चिलो हुन्छ',
                'slug' => 'घरभन्दा-अपार्टमेन्ट-खर्चिलो-हुन्छ',
                'province_id' => 3,
                'description' => '२२ मंसिर, काठमाडौं । शहरी भेगमा पछिल्लो समय अपार्टमेन्ट संस्कृतिको प्रयोग बढ्दो छ । सामान्यतया शहरमा घर किन्न महँगो हुने हुँदा सामूहिक बसोबास गर्ने अवधारणा भएपनि नेपाली परिपाटी फरक छ ।

                नेपालमा अपार्टमेन्ट खरिद गर्न र घर बनाउन खर्चको हिसाबले उस्तै–उस्तै पर्ने गर्छ । तर पनि सुरक्षा लगायतका थप सुविधाको हिसाबले अपार्टमेन्टमा बस्ने संस्कृति पछिल्लो समय बढ्दो छ ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 10,
                'title' => 'तीनै तहको चुनाव मंसिरमा गर्ने हो',
                'slug' => 'तीनै-तहको-चुनाव-मंसिरमा-गर्ने-हो',
                'province_id' => 3,
                'description' => '८ माघ, काठमाडौं । सत्तारुढ पाँचदलीय गठबन्धनले वैशाखमा प्रतिनिधिसभाको अर्ली इलेक्सन गर्ने प्रस्तावको च्याप्टर क्लोज गरेको छ । तर तीनै तहको निर्वाचन एकै पटक गर्ने बहस थालेको छ । त्यसअनुसार हुने हो भने आगामी मंसीरमा प्रतिनिधिसभा, प्रदेशसभा र स्थानीय तहको चुनाव हुनेछ ।

                अर्थात् निर्वाचन आयोगले सिफारिश गरे झैं वैशाख १४ र २२ मा चुनाव हुने सम्भावना कम छ ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 11,
                'title' => 'कम्युनिस्टसँग भिड्न मसँग सबै चीज छ',
                'slug' => 'कम्युनिस्टसँग-भिड्न-मसँग-सबै-चीज-छ',
                'province_id' => 3,
                'description' => '२८ कात्तिक, बाह्रबिसे (सिन्धुपाल्चोक) । प्रतिस्पर्धी र सुरक्षा संवेदनशीलताको हिसाबले पहिलो चरणको चुनावको इपिसेन्टर बनेको सिन्धुपाल्चोकका विभिन्न गाउँको भ्रमणपछि अनलाइनखबरको टिम कोदारी पुग्दा माओवादी नेता अग्नि सापकोटा विकट थामी गाउँमा भेटिए ।

                प्रदेशसभामा उम्मेदवार बनेका एमाले नेता अरुण नेपालसँगै तातोपानी क्षेत्रमा सोमवार विहान घरदैलो गरिरहेका प्रतिनिधिसभा क्षेत्र नम्बर १ का उम्मेदवार सापकोटा निकै हतारमा देखिन्थे ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 14,
                'title' => 'रानीसाहेब',
                'slug' => 'रानीसाहेब',
                'province_id' => 3,
                'description' => 'ब्रिगेडिएर जर्नल कबिन्द्रबहादुर शाहीको सुरक्षागार्ड थिएँ म। त्यतिबेला जतिबेला यो रमाइलो घटना घट्यो जिन्दगीमा। सेक्युरिटी गार्डमा म सुबेदार मेजर थिएँ र मेरै कमान्डमा थिए अरु चार जवान सिपाही। म दिपेन्द्र ढकाल। कान्छी रानीसाहेबको मन पर्दा बोलाउने दिपु र राजासाहेबले मन पर्दा बोलाउने नाम बाजे।

                बाहुन भएको नाताले मैले विशेष सुविधा पाएको थिएँ। उहाँका दुई रानी थिए। कान्छी रानी पाल्पा रिडीकी। पाल्पाको कमान्ड हुँदा उतै बिहे गर्नुभएको। जेठी रानी गोरखा सिरानचोककी थिइन्। रानीसाहेबहरु पनि उत्तिकै मजाका र दयालु थिए। दुई सौतामा कहिल्यै झगडा हुँदैनथ्यो। वास्तवमा जहाँ अभाव छ त्यही हुने त हो झगडा पनि।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 15,
                'title' => 'विशेषाधिकारबाट संसद ब्युँतिनसक्छ',
                'slug' => 'विशेषाधिकारबाट-संसद-ब्युँतिनसक्छ',
                'province_id' => 3,
                'description' => '५ पुस, काठमाडौं । प्रधानमन्त्री केपी शर्मा ओलीको सिफारिसमा राष्ट्रपति विद्यादेवी भण्डारीले संसद विघटन गरेसँगै संविधानको धारा १०३ को व्यवस्थाबारे राजनीतिक वृत्तमा बहस सुरु भएको छ ।

                संविधानको धारा १०३ ले प्रधानमन्त्री, राष्ट्रपति र प्रधानन्यायाधीशको मिलेमतोमा संसद विघटन गरिए पनि ‘सार्वभौम संसद’ विघटन हुन नसक्ने व्यवस्थाको परिकल्पना गरेको कानुनविदको तर्क छ । तर कतिपयले धारा १०३ सदन चलिरहेको अवस्थामा मात्रै लागू हुने तर्क गरेका छन् ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],

            [
                'category_id' => 16,
                'title' => 'देशका लागि गोल गर्न बाँकी नै छ',
                'slug' => 'देशका-लागि-गोल-गर्न-बाँकी-नै-छ',
                'province_id' => 3,
                'description' => '२२ फागुन, काठमाडौं । फुटबल नै हो मेरो कथा । तर सुनाउन लायक कथा अझै बनिसकेको छैन । भर्खर दुई सिजन लिग खेलेँ । राष्ट्रिय टिमबाट एक खेल खेलेँ । फेरि राष्ट्रिय टिमको क्याम्पमा परेको छु । अझ मिहिनेत गर्नुछ ।

                तर भर्खरै सकिएको शहीद स्मारक ए डिभिजन लिगले मलाई चर्चा दिलायो । सर्वाधिक गोलकर्ता बनेँ, सबैले थाहा पाए । रंगशालामा नजिकै हुर्किएँ, पढेँ । स्कुल सकिनेबितिकै ठूला खेलाडीहरुसँग संगत भयो । विभिन्न क्लबहरु चहारेँ । सीदेखि ए डिभिजन लिग खेलेँ, त्यो पनि फरक-फरक क्लबबाट । अहिले सशस्त्र प्रहरी एपीएफमा जागिर खाँदै फुटबल खेलिरहेको छु । कुनै दिन लाहुरे बन्न भारत पनि गएको थिएँ, तर लिखितमा नाम ननिस्किएपछि त्यो रहर पूरा भएन ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],
            [
                'category_id' => 13,
                'title' => 'रुसविरुद्ध लड्न कसले दान दियो युक्रेनलाई करोडौं बिटक्वाइन',
                'slug' => 'रुसविरुद्ध-लड्न-कसले-दान-दियो-युक्रेनलाई-करोडौं-बिटक्वाइन',
                'province_id' => 3,
                'description' => 'युक्रेनलाई रुससँगको युद्धमा सहयोग गर्नका लागि अहिलेसम्म अज्ञात दाताहरूले झण्डै पौने दुई अर्ब रुपैयाँ बराबरको क्रिप्टोकरेन्सी सहयोग गरेका छन् ।

                क्रिप्टोकरेन्सी विशेषज्ञहरूका अनुसार युक्रेनलाई अहिलेसम्म अज्ञात बिटक्वाइन दानको माध्यमबाट कम्तिमा एक करोड ३७ लाख अमेरिकी डलर रकम प्राप्त भएको छ ।

                ब्लकचेन विश्लेषण कम्पनी एलिस्टिकका शोधकर्ताहरूका अनुसार युक्रेनको सरकार, त्यहाँ कार्यरत गैरसरकारी संगठन तथा स्वयंसेवक समूहहरूले आफ्नो बिटक्वाइन वालेटको अनलाइन प्रचारका माध्यमबाट सहयोग जुटाइरहेका छन् ।

                शोधकर्ताका अनुसार हालसम्म ४ हजार भन्दा धेरै मानिसहरूले युक्रेनलाई रुसविरुद्धको युद्धमा सहयोग गर्न दान गरिसकेका छन् । एकजना दाता एक्लैले एउटा गैरसरकारी संस्थामार्फत् ३० लाख डलर मूल्य बराबरको बिटक्वाइन दान गरेका छन् । दाताहरुले औसतमा ९५ डलर प्रतिव्यक्ति बिटक्वाइन सहयोग गरेका छन् ।

                शनिबार दिउँसो युक्रेन सरकारले आफ्नो आधिकारिक सरकारी ट्वीटर अकाउन्टमा एक सन्देश जारी गर्दै युक्रेनका जनताहरूलाई साथ दिन अपिल गर्दै सरकारले क्रिप्टोकरेन्सीमा समेत दान स्विकार गरिरहेको भन्दै बिटक्वाइन, इथेरियम तथा अमेरिकी डलरमा दान दिन आग्रह गरेको थियो ।

                सरकारले दुईवटा क्रिप्टोकरेन्सी वालेटको ठेगाना बताएकोमा ५४ लाख डलरभन्दा धेरै चन्दा आइसकेको छ । आठ घण्टाभित्रैमा बिटक्वाइन, इथेरियम तथा अन्य क्रिप्टोकरेन्सीमा उक्त चन्दा युक्रेनलाई प्राप्त भएको हो ।

                युक्रेनको डिजिटल मन्त्रालयका अनुसार उक्त दान युक्रेनको प्रतिरोध अभियानमा सहयोग गर्नका लागि हो । यद्यपि उक्त रकमको प्रयोग कसरी गर्ने भन्ने विषयमा मन्त्रालयले बताएको छैन ।

                एलिप्टिकका संस्थापक टम रोबिन्सनका अनुसार कतिपय क्राउड फन्डिंग प्लाटर्फम तथा पेमेन्ट कम्पनीहरूले युक्रेनको समर्थन गर्ने समूहहरूका लागि दान गर्नेहरूलाई रोकिदिएका छन् । त्यस्तो अवस्थामा बिटक्वाइन तथा अन्य क्रिप्टोकरेन्सी नै युक्रेनका लागि दान प्राप्त गर्ने ससक्त माध्यम बनेको छ ।

                शुक्रबार मात्र पैसा जुटाउने प्लाटर्फम पेट्रियोनले कम ब्याक अलाइभ अभियानको फण्डलाई रोक्का गरेको घोषणा गरेको थियो । युक्रेनको उक्त गैर सरकारी संस्थाले सन् २०१४ देखि युक्रेनको सैन्यबलका लागि कोष जम्मा गर्ने ग्रेको छ ।

                तर पेट्रियोनमा आफ्नो विज्ञप्तीमा आफ्नो प्लाटर्फमको प्रयोग सैन्य गतिविधिहरुका लागि कोष जुटाउनका लागि गर्न नदिने बताएको छ ।

                संसारभर चलिरहेका संघर्षमा त्रिप्टोकरेन्सी सहयोग जुटाउने एक लोकप्रिय माध्यम बनिरहेको छ । उता स्क्याम गर्ने गिरोहहरूले समेत युक्रेनको विद्यमान संकटको फाइदा उठाउने कोसिस गरिरहेका छन् र आफ्नो डिजिटल वालेटमा रकम सहयोग गर्न मानिसहरुलाई उक्साइरहेका छन् ।',
                'is_trending' => 1,
                'is_main_news' => 0,
                'status' => '1'
            ],
        ];
        collect($news)->each(function($new){
            $new = News::create($new);
            $new->addMediaFromUrl(asset('frontend/img/news/'.$new->id.'.jpg'))->toMediaCollection();
        });
    }
}
